codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efk064.h
#define _OFF106_VOFF_POSITION                    0x00000001
#define _OFF106_VOFF_MASK                        0x0003FFFE
#define _OFF106_VOFF_LENGTH                      0x00000011

#define _OFF107_VOFF_POSITION                    0x00000001
#define _OFF107_VOFF_MASK                        0x0003FFFE
#define _OFF107_VOFF_LENGTH                      0x00000011

#define _OFF109_VOFF_POSITION                    0x00000001
#define _OFF109_VOFF_MASK                        0x0003FFFE
#define _OFF109_VOFF_LENGTH                      0x00000011

#define _OFF110_VOFF_POSITION                    0x00000001
#define _OFF110_VOFF_MASK                        0x0003FFFE
#define _OFF110_VOFF_LENGTH                      0x00000011

#define _OFF111_VOFF_POSITION                    0x00000001
#define _OFF111_VOFF_MASK                        0x0003FFFE
#define _OFF111_VOFF_LENGTH                      0x00000011

#define _OFF112_VOFF_POSITION                    0x00000001
#define _OFF112_VOFF_MASK                        0x0003FFFE
#define _OFF112_VOFF_LENGTH                      0x00000011

#define _OFF113_VOFF_POSITION                    0x00000001
#define _OFF113_VOFF_MASK                        0x0003FFFE
#define _OFF113_VOFF_LENGTH                      0x00000011

#define _OFF114_VOFF_POSITION                    0x00000001
#define _OFF114_VOFF_MASK                        0x0003FFFE
#define _OFF114_VOFF_LENGTH                      0x00000011

#define _OFF115_VOFF_POSITION                    0x00000001
#define _OFF115_VOFF_MASK                        0x0003FFFE
#define _OFF115_VOFF_LENGTH                      0x00000011

#define _OFF116_VOFF_POSITION                    0x00000001
#define _OFF116_VOFF_MASK                        0x0003FFFE
#define _OFF116_VOFF_LENGTH                      0x00000011

#define _OFF117_VOFF_POSITION                    0x00000001
#define _OFF117_VOFF_MASK                        0x0003FFFE
#define _OFF117_VOFF_LENGTH                      0x00000011

#define _OFF119_VOFF_POSITION                    0x00000001
#define _OFF119_VOFF_MASK                        0x0003FFFE
#define _OFF119_VOFF_LENGTH                      0x00000011

#define _OFF120_VOFF_POSITION                    0x00000001
#define _OFF120_VOFF_MASK                        0x0003FFFE
#define _OFF120_VOFF_LENGTH                      0x00000011

#define _OFF121_VOFF_POSITION                    0x00000001
#define _OFF121_VOFF_MASK                        0x0003FFFE
#define _OFF121_VOFF_LENGTH                      0x00000011

#define _OFF122_VOFF_POSITION                    0x00000001
#define _OFF122_VOFF_MASK                        0x0003FFFE
#define _OFF122_VOFF_LENGTH                      0x00000011

#define _OFF123_VOFF_POSITION                    0x00000001
#define _OFF123_VOFF_MASK                        0x0003FFFE
#define _OFF123_VOFF_LENGTH                      0x00000011

#define _OFF124_VOFF_POSITION                    0x00000001
#define _OFF124_VOFF_MASK                        0x0003FFFE
#define _OFF124_VOFF_LENGTH                      0x00000011

#define _OFF128_VOFF_POSITION                    0x00000001
#define _OFF128_VOFF_MASK                        0x0003FFFE
#define _OFF128_VOFF_LENGTH                      0x00000011

#define _OFF129_VOFF_POSITION                    0x00000001
#define _OFF129_VOFF_MASK                        0x0003FFFE
#define _OFF129_VOFF_LENGTH                      0x00000011

#define _OFF130_VOFF_POSITION                    0x00000001
#define _OFF130_VOFF_MASK                        0x0003FFFE
#define _OFF130_VOFF_LENGTH                      0x00000011

#define _OFF131_VOFF_POSITION                    0x00000001
#define _OFF131_VOFF_MASK                        0x0003FFFE
#define _OFF131_VOFF_LENGTH                      0x00000011

#define _OFF132_VOFF_POSITION                    0x00000001
#define _OFF132_VOFF_MASK                        0x0003FFFE
#define _OFF132_VOFF_LENGTH                      0x00000011

#define _OFF133_VOFF_POSITION                    0x00000001
#define _OFF133_VOFF_MASK                        0x0003FFFE
#define _OFF133_VOFF_LENGTH                      0x00000011

#define _OFF134_VOFF_POSITION                    0x00000001
#define _OFF134_VOFF_MASK                        0x0003FFFE
#define _OFF134_VOFF_LENGTH                      0x00000011

#define _OFF135_VOFF_POSITION                    0x00000001
#define _OFF135_VOFF_MASK                        0x0003FFFE
#define _OFF135_VOFF_LENGTH                      0x00000011

#define _OFF136_VOFF_POSITION                    0x00000001
#define _OFF136_VOFF_MASK                        0x0003FFFE
#define _OFF136_VOFF_LENGTH                      0x00000011

#define _OFF137_VOFF_POSITION                    0x00000001
#define _OFF137_VOFF_MASK                        0x0003FFFE
#define _OFF137_VOFF_LENGTH                      0x00000011

#define _OFF138_VOFF_POSITION                    0x00000001
#define _OFF138_VOFF_MASK                        0x0003FFFE
#define _OFF138_VOFF_LENGTH                      0x00000011

#define _OFF139_VOFF_POSITION                    0x00000001
#define _OFF139_VOFF_MASK                        0x0003FFFE
#define _OFF139_VOFF_LENGTH                      0x00000011

#define _OFF140_VOFF_POSITION                    0x00000001
#define _OFF140_VOFF_MASK                        0x0003FFFE
#define _OFF140_VOFF_LENGTH                      0x00000011

#define _OFF141_VOFF_POSITION                    0x00000001
#define _OFF141_VOFF_MASK                        0x0003FFFE
#define _OFF141_VOFF_LENGTH                      0x00000011

#define _OFF142_VOFF_POSITION                    0x00000001
#define _OFF142_VOFF_MASK                        0x0003FFFE
#define _OFF142_VOFF_LENGTH                      0x00000011

#define _OFF143_VOFF_POSITION                    0x00000001
#define _OFF143_VOFF_MASK                        0x0003FFFE
#define _OFF143_VOFF_LENGTH                      0x00000011

#define _OFF144_VOFF_POSITION                    0x00000001
#define _OFF144_VOFF_MASK                        0x0003FFFE
#define _OFF144_VOFF_LENGTH                      0x00000011

